1Ô∏è‚É£ Student Result Analysis

Dataset idea: Marks of students in different subjects

Tasks:

Load CSV using Pandas

Calculate average marks

Find topper

Find subject-wise highest score

Filter students who failed

üëâ Skills: filtering, aggregation, sorting, groupby

In [1]:
import pandas as pd

In [27]:
student_marks = {
    "Names" : ["Alice", "Bob", "Charlie", "David", "Eve","Priya","Ria","Sriya","Mouni","Maanushi"],
    "Maths" : [25, 92, 78, 96, 99, 90, 82, 40,98,99],
    "CS": [38, 90, 45, 60, 98, 99, 62, 78, 89, 92],
    "Stats" : [98, 96, 89, 76, 98, 97, 89, 67, 79 ,86]
}
df1 = pd.DataFrame(student_marks)
df1

      Names  Maths  CS  Stats
0     Alice     25  38     98
1       Bob     92  90     96
2   Charlie     78  45     89
3     David     96  60     76
4       Eve     99  98     98
5     Priya     90  99     97
6       Ria     82  62     89
7     Sriya     40  78     67
8     Mouni     98  89     79
9  Maanushi     99  92     86

In [28]:
df = df1.to_csv("student_marks.csv", index=False)

In [29]:
df = pd.read_csv("student_marks.csv")

In [30]:
df.describe()

           Maths         CS      Stats
count  10.000000  10.000000  10.000000
mean   79.900000  75.100000  87.500000
std    26.201993  22.328109  10.617072
min    25.000000  38.000000  67.000000
25%    79.000000  60.500000  80.750000
50%    91.000000  83.500000  89.000000
75%    97.500000  91.500000  96.750000
max    99.000000  99.000000  98.000000

In [31]:
df.head(3)

     Names  Maths  CS  Stats
0    Alice     25  38     98
1      Bob     92  90     96
2  Charlie     78  45     89

In [32]:
df.tail(3)

      Names  Maths  CS  Stats
7     Sriya     40  78     67
8     Mouni     98  89     79
9  Maanushi     99  92     86

In [35]:
#Calculate average marks
average_marks = df[["Maths","CS","Stats"]].values.mean()
print(f"Average marks of a students: {average_marks}")

Average marks of a students: 80.83333333333333

In [47]:
#Find topper
df["total"] = df[["Maths","CS","Stats"]].sum(axis=1)
topper_name = df.loc[df["total"].idxmax()]
print("Topper:", topper_name)

Topper: Names    Eve
Maths     99
CS        98
Stats     98
total    295
Name: 4, dtype: object

In [ ]:
#Find subject-wise highest score
high_score = df[["Maths","CS","Stats"]].max(axis=0)
print("subject-wise highest score:")
print(high_score)

subject-wise highest score
Maths    99
CS       99
Stats    98
dtype: int64

In [59]:
#Filter students who failed
failed_students = df[
    (df[["Maths", "CS", "Stats"]] <= 40).any(axis=1)
]

print(failed_students)

   Names  Maths  CS  Stats  total
0  Alice     25  38     98    161
7  Sriya     40  78     67    185